Repository: mbuilov/gawk-windows
Catalog: po/*.po
Languages: ro

source: attempt to use scalar parameter `%s' as an array
ro: încercare de utilizare a parametrului scalar `%s' drept array

source: attempt to use scalar `%s' as array
ro: încercare de a utiliza scalarul `%s' ca array

source: subscript of array `%s' is null string
ro: înscrierea array-ului `%s' este ºir null

source: delete: index `%s' not in array `%s'
ro: delete: indexul `%s' nu este în array-ul `%s'

source: %s: empty (null)
ro: %s: vid (null)

source: %s: empty (zero)
ro: %s: vid (zero)

source: %s: array_ref to %s
ro: %s: array_ref cãtre %s

source: `%s' is a built-in function, it cannot be redefined
ro: `%s' este funcþie internã, nu poate fi redefinitã

source: regexp constant `/%s/' looks like a C comment, but is not
ro: constanta regexp `/%s/' aratã ca un comentariu C, dar nu este

source: statement may have no effect
ro: declaraþia poate sã nu aibã nici un efect

source: `nextfile' is a gawk extension
ro: `nextfile' este extensie gawk

source: `return' used outside function context
ro: `return' folosit în afara contextului funcþiei

source: plain `print' in BEGIN or END rule should probably be `print ""'
ro: `print' simplu din regulile BEGIN sau END ar trebui sã fie probabil `print ""'

source: `delete array' is a gawk extension
ro: `delete array' este extensie gawk

source: multistage two-way pipelines don't work
ro: legãturile(pipelines) bidirecþionale multistage nu vor funcþiona

source: regular expression on right of assignment
ro: expresie regularã în dreapta atribuirii

source: regular expression on left of `~' or `!~' operator
ro: expresie regularã în stânga operatorului `~' sau `!~'

source: regular expression on right of comparison
ro: expresie regularã în dreapta comparaþiei

source: non-redirected `getline' undefined inside END action
ro: `getline' nedefinitã ºi neredirectatã înãuntrul unei acþiuni END

source: call of `length' without parentheses is not portable
ro: apelarea lui `legth' fãrã paranteze nu este portabilã

source: call of `length' without parentheses is deprecated by POSIX
ro: apelarea lui `length' fãrã paranteze nu mai este folositã în POSIX

source: invalid subscript expression
ro: expresie subscript invalidã

source: empty program text on command line
ro: text program vid în linia de comandã

source: can't open source file `%s' for reading (%s)
ro: nu se poate deschide fiºierul sursã `%s' pentru citire (%s)

source: can't read sourcefile `%s' (%s)
ro: nu se poate citi fiºierul sursã `%s' (%s)

source: source file `%s' is empty
ro: fiºierul sursã `%s' este vid

source: source file does not end in newline
ro: fiºierul sursã nu se terminã în linie nouã

source: unterminated regexp ends with `\' at end of file
ro: regexp-ul neterminat se terminã cu `\'` la sfârºitul fiºierului

source: unterminated regexp
ro: regexp neterminat

source: unterminated regexp at end of file
ro: regexp neterminat la sfârºitul fiºierului

source: use of `\ #...' line continuation is not portable
ro: folosirea continuãrii liniei `\ #...' nu este portabilã

source: backslash not last character on line
ro: backslash nu este ultimul caracter din linie

source: POSIX does not allow operator `**='
ro: POSIX nu permite operatorul `**='

source: old awk does not support operator `**='
ro: vechiul awk nu suportã operatorul `**='

source: POSIX does not allow operator `**'
ro: POSIX nu permite operatorul `**'

source: old awk does not support operator `**'
ro: vechiul awk nu supoortã operatorul `**'

source: operator `^=' is not supported in old awk
ro: operatorul `^=' nu este suportat în vechiul awk

source: operator `^' is not supported in old awk
ro: operator `^' nu este suportat în vechiul awk

source: unterminated string
ro: ºir de caractere neterminat

source: invalid char '%c' in expression
ro: caracter invalid `%c' în expresie

source: `%s' is a gawk extension
ro: `%s' este extensie gawk

source: `%s' is a Bell Labs extension
ro: `%s' este extensie Bell Labs

source: POSIX does not allow `%s'
ro: POSIX nu permite `%s'

source: `%s' is not supported in old awk
ro: `%s' nu este suportat în vechiul awk

source: `goto' considered harmful!
ro: `goto' este considerat periculos!

source: %d is invalid as number of arguments for %s
ro: %d este invalid ca numãr de argumente pentru %s

source: match: third argument is a gawk extension
ro: match: al treilea argument este extensie gawk

source: %s: string literal as last arg of substitute has no effect
ro: %s: ºirul de caractere literal ca ultim argument al înlocuitorului nu are nici un efect

source: close: second argument is a gawk extension
ro: close: al doilea argument este extensie gawk

source: use of dcgettext(_"...") is incorrect: remove leading underscore
ro: folosirea lui dcgettext(_"...") este incorectã: eliminaþi liniuþa_jos de la început

source: function `%s': parameter #%d, `%s', duplicates parameter #%d
ro: funcþia `%s': parametrul #%d, `%s', parametrul duplicat #%d

source: function `%s': parameter `%s' shadows global variable
ro: funcþia `%s': parametrul `%s' nu mai þine cont de(shadows) variabila globalã

source: could not open `%s' for writing (%s)
ro: nu s-a putut deschide `%s' pentru scriere (%s)

source: sending profile to standard error
ro: se trimite profilul la dipsozitivul de eroare standard

source: %s: close failed (%s)
ro: %s: închidere eºuatã (%s)

source: shadow_funcs() called twice!
ro: shadow_funcs() apelatã de douã ori!

source: function `%s': can't use function name as parameter name
ro: funcþia `%s': nu se poate folosi numele funcþiei ca nume de parametru

source: function name `%s' previously defined
ro: numele funcþiei `%s' a mai fost definit înainte

source: function `%s' called but never defined
ro: funcþia `%s' este apelatã dar niciodatã definitã

source: function `%s' defined but never called
ro: funcþia `%s' este definitã dar niciodatã apelatã

source: regexp constant for parameter #%d yields boolean value
ro: regexp constant pentru parametrul #%d solicitã(yields) valoare booleanã

source: division by zero attempted in `%%'
ro: s-a încercat împãrþire la zero în `%%'

source: %s to "%s" failed (%s)
ro: %s cãtre "%s" eºuatã (%s)

source: standard output
ro: ieºire(output) standard

source: reason unknown
ro: motiv necunoscut

source: exp: received non-numeric argument
ro: exp: s-a primit argument nenumeric

source: exp: argument %g is out of range
ro: exp: argumentul %g este în afara domeniului

source: fflush: cannot flush: pipe `%s' opened for reading, not writing
ro: fflush: nu s-a putut face flush: legãtura(pipe) `%s' a fost deschisã pentru citire, nu scriere

source: fflush: cannot flush: file `%s' opened for reading, not writing
ro: fflush: nu s-a putut face flush: fiºierul `%s' a fost deschis pentru citire, nu scriere

source: fflush: `%s' is not an open file, pipe or co-process
ro: fflush: `%s' nu este fiºier deschis, legãturã(pipe) sau co-proces

source: index: received non-string first argument
ro: index: s-a primit un prim argument non-ºir de caractere

source: index: received non-string second argument
ro: index: s-a primit un al doilea argument non-ºir de caractere

source: int: received non-numeric argument
ro: int: s-a primit argument nenumeric

source: length: received non-string argument
ro: legth: s-a primit argument non-string

source: log: received non-numeric argument
ro: log: s-a primit argument nenumeric

source: log: received negative argument %g
ro: log: s-a primit argument %g negativ

source: `$' is not permitted in awk formats
ro: `$' nu este permis în formatele awk

source: arg count with `$' must be > 0
ro: numãrul de arg cu `%' trebuie sã fie > 0

source: `$' not permitted after period in format
ro: `$' nu este permis în format dupã punct

source: no `$' supplied for positional field width or precision
ro: nu s-a furnizat nici un `$' pentru câmpul poziþional lungime sau precisie

source: `l' is meaningless in awk formats; ignored
ro: `l' nu are sens în formatele awk; ignorat

source: `l' is not permitted in POSIX awk formats
ro: `l' nu este permis în formatele awk POSIX

source: `L' is meaningless in awk formats; ignored
ro: `L' nu are sens în formatele awk; ignorat

source: `L' is not permitted in POSIX awk formats
ro: `L' nu este permis în formatele POSIX awk

source: `h' is meaningless in awk formats; ignored
ro: `h' nu are sens în formatele awl; ignorat

source: `h' is not permitted in POSIX awk formats
ro: `h' nu este permis în formatele POSIX awk

source: not enough arguments to satisfy format string
ro: nu existã destule argumente pentru satisfacerea formatului ºirului de caractere

source: ^ ran out for this one
ro: ^ insuficient pentru aceasta

source: [s]printf: format specifier does not have control letter
ro: [s]printf: specificatorul de format nu are literã de control

source: too many arguments supplied for format string
ro: prea multe argumente furnizate pentru formatul ºirului de caractere

source: printf: no arguments
ro: printf: nici un argument

source: sqrt: received non-numeric argument
ro: sqrt: s-a primit argument nenumeric

source: sqrt: called with negative argument %g
ro: sqrt: apelat cu argumentul negativ %g

source: substr: start index %g is invalid, using 1
ro: substr: indexul de start %g este invalid, se foloseºte -1

source: substr: non-integer start index %g will be truncated
ro: substr: indexul de start ne-întreg(integer) %g va fi trunchiat

source: substr: non-integer length %g will be truncated
ro: substr lungimea ne-întregului(integer) %g va fi trunchiatã

source: substr: source string is zero length
ro: substr: ºirul de caractere sursã are lungime zero

source: strftime: received empty format string
ro: strftime: s-a primit ºir de caractere în format vid

source: mktime: received non-string argument
ro: mktime: s-a primit argument non ºir de caractere

source: atan2: received non-numeric first argument
ro: atan2: s-a primit un prim argument nenumeric

source: atan2: received non-numeric second argument
ro: atan2: s-a primit un al doilea argument nenumeric

source: sin: received non-numeric argument
ro: sin: s-a primit un argument nenumeric

source: cos: received non-numeric argument
ro: cos: s-a primit un argument nenumeric

source: srand: received non-numeric argument
ro: srand: s-a primit un argument nenumeric

source: match: third argument is not an array
ro: match: al treilea argument nu este un array

source: lshift: received non-numeric first argument
ro: lshift: s-a primit un prim argument nenumeric

source: lshift(%lf, %lf): negative values will give strange results
ro: lshift(%lf, %lf): valorile negative vor furniza rezultate ciudate

source: lshift(%lf, %lf): fractional values will be truncated
ro: lshift(%lf, %lf): valorile fracþionale vor fi trunchiate

source: lshift(%lf, %lf): too large shift value will give strange results
ro: lshift(%lf, %lf): valorile schimbate prea mult vor da rezultate ciudate

source: rshift: received non-numeric first argument
ro: rshift: s-a primit un prim argument nenumeric

source: rshift(%lf, %lf): negative values will give strange results
ro: rshift(%lf, %lf): valorile negative vor da rezultate ciudate

source: rshift(%lf, %lf): fractional values will be truncated
ro: rshift(%lf, %lf): valorile fracþionale vor fi trunchiate

source: rshift(%lf, %lf): too large shift value will give strange results
ro: rshift(%lf, %lf): valorile schimbate prea mult vor da rezultate ciudate

source: and: received non-numeric first argument
ro: and: s-a primit un prim argument nenumeric

source: and(%lf, %lf): negative values will give strange results
ro: and(%lf, %lf): valorile negative vor da rezultate ciudate

source: and(%lf, %lf): fractional values will be truncated
ro: and(%lf, %lf): valorile fracþionale vor fi trunchiate

source: or: received non-numeric first argument
ro: or: s-a primit un prim argument nenumeric

source: or(%lf, %lf): negative values will give strange results
ro: or(%lf, %lf): valorile negative for da rezultate ciudate

source: or(%lf, %lf): fractional values will be truncated
ro: or(%lf, %lf): valorile fracþionale vor fi trunchiate

source: xor: received non-numeric first argument
ro: xor: s-a primit un prim argument nenumeric

source: xor(%lf, %lf): negative values will give strange results
ro: xor(%lf, %lf): valorile negative vor da rezultate ciudate

source: xor(%lf, %lf): fractional values will be truncated
ro: xor(%lf, %lf): valorile fracþionale vor fi trunchiate

source: compl: received non-numeric argument
ro: compl: s-a primit argument nenumeric

source: compl(%lf): negative value will give strange results
ro: compl(%lf): valorile negative vor da rezultate ciudate

source: compl(%lf): fractional value will be truncated
ro: compl(%lf): valorile fracþionale vor fi trunchiate

source: dcgettext: `%s' is not a valid locale category
ro: dcgettext: `%s' nu este o categorie localã validã

source: unknown nodetype %d
ro: tip nod %d necunoscut

source: buffer overflow in genflags2str
ro: depãºire(overflow) de buffer în genflags2str

source: attempt to use array `%s' in a scalar context
ro: încercare de a utiliza array-ul `%s' într-un context scalar

source: `break' outside a loop is not portable
ro: `break' în afara buclei nu este portabil

source: `break' outside a loop is not allowed
ro: `break' în afara buclei nu este permis

source: `continue' outside a loop is not portable
ro: `continue' în afara buclei nu este portabil

source: `continue' outside a loop is not allowed
ro: `continue' în afara buclei nu este permis

source: `next' cannot be called from a BEGIN rule
ro: `next' nu poate fi apelat dintr-o regulã BEGIN

source: `next' cannot be called from an END rule
ro: `next' nu poate fi apelat dintr-o regulã END

source: `nextfile' cannot be called from a BEGIN rule
ro: `nextfile' nu poate fi apelat dintr-o regulã BEGIN

source: `nextfile' cannot be called from an END rule
ro: `nextfile' nu poate fi apelat dintr-o regulã END

source: statement has no effect
ro: declaraþia nu are nici un efect

source: can't use function name `%s' as variable or array
ro: nu se poate folosi numele funcþiei `%s' ca variabilã sau array

source: reference to uninitialized argument `%s'
ro: referinþã la argumentul neiniþializat `%s'

source: reference to uninitialized variable `%s'
ro: referinþã la variabila neiniþializatã `%s'

source: concatenation: side effects in one expression have changed the length of another!
ro: concatenation: efectele secundare dintr-o expresie au schimbat lungimea alteia!

source: assignment used in conditional context
ro: atribuire folositã în context condiþional

source: division by zero attempted
ro: s-a încercat împãrþire la zero

source: illegal type (%s) in tree_eval
ro: tip ilegal (%s) în tree_eval

source: division by zero attempted in `/='
ro: s-a încercat împãrþire la zero în `/='

source: division by zero attempted in `%%='
ro: s-a încercat împãrþire la zero în `%%='

source: function `%s' called with more arguments than declared
ro: funcþia `%s' a fost apelatã cu mai multe argumente decât cele declarate

source: function `%s' not defined
ro: funcþia `%s' nu este definitã

source: # Function Call Stack:
ro: # Stiva de Apelare a Funcþiei:

source: # -- main --
ro: # -- principal(main) --

source: attempt to field reference from non-numeric value
ro: încercare de referinþã la câmp din valoare nenumericã

source: attempt to reference from null string
ro: încercare de referinþã din ºir de caractere vid(null)

source: attempt to access field %d
ro: încercare de accesare a câmpului %d

source: assignment is not allowed to result of builtin function
ro: atribuirea nu este permisã rezultatului funcþiei interne

source: `IGNORECASE' is a gawk extension
ro: `IGNORECASE' este extensie gawk

source: `BINMODE' is a gawk extension
ro: `BINMODE' este extensie gawk

source: bad `%sFMT' specification `%s'
ro: `%sFMT' specificaþie `%s' invalidã

source: turning off `--lint' due to assignment to `LINT'
ro: se dezactiveazã `--lint' din cauza atribuirii lui `LINT'

source: `extension' is a gawk extension
ro: `extension' este o extensie gawk

source: extension: cannot open `%s' (%s)
ro: extension: nu s-a putut deschide `%s' (%s)

source: extension: library `%s': cannot call function `%s' (%s)
ro: extension: biblioteca `%s': nu pot apela funcþia `%s' (%s)

source: Operation Not Supported
ro: Operaþie NeSuportatã

source: NF set to negative value
ro: NF setat la valoare negativã

source: split: second argument is not an array
ro: split: al doilea argument nu este un array

source: split: null string for third arg is a gawk extension
ro: split: ºirul nul pentru al treilea arg este o extensie gawk

source: `FIELDWIDTHS' is a gawk extension
ro: `FIELDWIDTHS' este extensie gawk

source: null string for `FS' is a gawk extension
ro: ºirul de caractere null pentru `FS' este extensie gawk

source: cannot open file `%s' for reading (%s)
ro: nu s-a putu deschide `%s' pentru citire (%s)

source: close of fd %d (`%s') failed (%s)
ro: închiderea lui fd %d (`%s') eºuatã (%s)

source: invalid tree type %s in redirect()
ro: tip arbore(tree) invalid %s în redirect()

source: expression in `%s' redirection only has numeric value
ro: expresia din redirectarea `%s' are doar valoare numericã

source: expression for `%s' redirection has null string value
ro: expresia din redirectarea `%s' are valoar de ºir null

source: filename `%s' for `%s' redirection may be result of logical expression
ro: numele de fiºier `%s' pentru redirectarea `%s' poate fi rezultatul unei expresii logice

source: unnecessary mixing of `>' and `>>' for file `%.*s'
ro: amestecare nenecesarã a `>' ºi `>>' pentru fiºierul `%.*s'

source: can't open pipe `%s' for output (%s)
ro: nu se poate deschide legãtura(pipe) `%s' pentru output (%s)

source: can't open pipe `%s' for input (%s)
ro: nu se poate deschide legãtura(pipe) `%s' pentru input (%s)

source: can't open two way pipe `%s' for input/output (%s)
ro: nu se poate deschide legãtura(pipe) bidirecþionalã `%s' pentru input/output (%s)

source: can't redirect from `%s' (%s)
ro: nu se poate redirecta din `%s' (%s)

source: can't redirect to `%s' (%s)
ro: nu se poate redirecta cãtre `%s' (%s)

source: reached system limit for open files: starting to multiplex file descriptors
ro: s-a atins limita sistemului pentru fiºiere deschise: se începe muliplexarea desciptorilor de fiºier

source: close of `%s' failed (%s).
ro: închiderea `%s' eºuatã (%s).

source: too many pipes or input files open
ro: prea multe legãturi(pipe) sau fiºiere de intrare(input) deschise

source: close: second argument must be `to' or `from'
ro: close: al doilea argument trebuie sã fie `to' sau `from'

source: close: `%.*s' is not an open file, pipe or co-process
ro: close: `%.*s' nu este un fiºier deschis, o legãturã(pipe) sau un coproces

source: close of redirection that was never opened
ro: închiderea unei redirectãri care n-a fost deschisã niciodatã

source: close: redirection `%s' not opened with `|&', second argument ignored
ro: close: redirectarea `%s' nu a fost deschisã cu `|&', al doilea argument ignorat

source: failure status (%d) on pipe close of `%s' (%s)
ro: stare de avarie (%d) în legãtura(pipe) închisã în `%s' (%s)

source: failure status (%d) on file close of `%s' (%s)
ro: stare de avarie (%d) în fiºierul închis în `%s' (%s)

source: no explicit close of socket `%s' provided
ro: nu s-a furnizat închiderea explicitã a socketului `%s'

source: no explicit close of co-process `%s' provided
ro: nu s-a furnizat închiderea explicitã a coprocesului `%s'

source: no explicit close of pipe `%s' provided
ro: nu s-a furnizat închiderea explicitã a legãturii(pipe) `%s'

source: no explicit close of file `%s' provided
ro: nu s-a furnizat închiderea explicitã a fiºierului `%s'

source: error writing standard output (%s)
ro: eroare în scrierea la ieºirea(output) standard (%s)

source: error writing standard error (%s)
ro: eroare în scrierea la dispozitivul standard de eroare (%s)

source: pipe flush of `%s' failed (%s).
ro: flush-ul legãturii(pipe) `%s' eºuat (%s).

source: co-process flush of pipe to `%s' failed (%s).
ro: flush-ul legãturii(pipe) coprocesului la `%s' eºuat (%s).

source: file flush of `%s' failed (%s).
ro: flush-ul de fiºier al `%s' eºuat (%s).

source: /inet/raw client not ready yet, sorry
ro: clientul /inet/raw nu este pregãtit încã, scuze

source: only root may use `/inet/raw'.
ro: doar root-ul poate folosi `/inet/raw'.

source: /inet/raw server not ready yet, sorry
ro: serverul /inet/raw nu este pregãtit încã, scuze

source: no (known) protocol supplied in special filename `%s'
ro: nici un protocol (cunoscut) furnizat în numele de fiºier special `%s'

source: special file name `%s' is incomplete
ro: numele special de fiºier `%s' nu este complet

source: must supply a remote hostname to `/inet'
ro: trebuie furnizat un nume de host remote pentru `/inet'

source: must supply a remote port to `/inet'
ro: trebuie furnizat un port remote pentru `/inet'

source: TCP/IP communications are not supported
ro: Comunicaþiile TCP/IP nu sunt suportate

source: file `%s' is a directory
ro: fiºierul `%s' este director

source: use `PROCINFO["%s"]' instead of `%s'
ro: folosiþi `PROCINFO["%s"]' în loc de `%s'

source: use `PROCINFO[...]' instead of `/dev/user'
ro: folosiþi `PROCINFO[...]' în loc de `/dev/user'

source: could not open `%s', mode `%s'
ro: nu s-a putut deschide `%s', modul `%s'

source: close of stdout in child failed (%s)
ro: închiderea stdout în copil(child) a eºuat (%s)

source: close of stdin in child failed (%s)
ro: închiderea stdin în copil(child) a eºuat (%s)

source: moving pipe to stdout in child failed (dup: %s)
ro: mutarea legãturii(pipe) la stdout în copil(child) a eºuat (dup: %s)

source: moving pipe to stdin in child failed (dup: %s)
ro: mutarea legãturii(pipe) la stdin în copil(child) a eºuat (dup: %s)

source: restoring stdout in parent process failed
ro: refacerea stdout în procesul pãrinte a eºuat

source: restoring stdin in parent process failed
ro: refacerea stdin în procesul pãrinte a eºuat

source: close of pipe failed (%s)
ro: închiderea legãturii(pipe) a eºuat (%s)

source: `|&' not supported
ro: `|&' nesuportat

source: cannot open pipe `%s' (%s)
ro: nu s-a putut deschide legãtura(pipe) `%s' (%s)

source: cannot create child process for `%s' (fork: %s)
ro: nu s-a putu crea proces copil(child) pentru `%s' (fork: %s)

source: data file `%s' is empty
ro: fiºierul de date `%s' este vid

source: error reading input file `%s': %s
ro: eroare în citirea fiºierului de intrare(input) `%s': %s

source: multicharacter value of `RS' is a gawk extension
ro: valoarea multicaracter a `RS' este extensie gawk

source: out of memory
ro: memorie plinã

source: `-m[fr]' option irrelevant in gawk
ro: `-m[fr]' opþiune irelevantã în gawk

source: -m option usage: `-m[fr] nnn'
ro: folosirea opþiunii -m : `-m[fr] nnn'

source: %s: option `-W %s' unrecognized, ignored
ro: %s: opþiunea `-W %s' nu e recunoscutã, ignoratã

source: empty argument to `--source' ignored
ro: argument vid pentru `--source' ignorat

source: %s: option requires an argument -- %c
ro: %s: opþiunea necesitã un parametru -- %c

source: environment variable `POSIXLY_CORRECT' set: turning on `--posix'
ro: este setatã variabila de mediu `POSIXLY_CORRECT': se activeazã `--posix'

source: `--posix' overrides `--traditional'
ro: `--posix' suprascrie `--traditional'

source: `--posix'/`--traditional' overrides `--non-decimal-data'
ro: `--posix'/`--traditional' suprascrie `--non-decimal-data'

source: no program text at all!
ro: nu existã nici un text de program!

source: Usage: %s [POSIX or GNU style options] -f progfile [--] file ...
ro: Folosire: %s [opþiuni stil POSIX sau GNU] -f fiºierprogram [--] fiºier ...

source: Usage: %s [POSIX or GNU style options] [--] %cprogram%c file ...
ro: Folosire: %s [opþiuni stil POSIX sau GNU] [--] %cprogram%c fiºier ...
