Repository: mbuilov/gawk-windows
Catalog: po/*.po
Languages: ro

source: POSIX options: GNU long options:
ro: opþiuni POSIX: opþiuni lungi GNU:

source: -f progfile --file=progfile
ro: -f fiºierprogram --file=fiºierprogram

source: -W dump-variables[=file] --dump-variables[=file]
ro: -W dump-variables[=fiºier] --dump-variables[=fiºier]

source: -W profile[=file] --profile[=file]
ro: -W profile[=fiºier] --profile[=fiºier]

source: This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details.
ro: Acest program este distribuit în speranþa cã va fi folositor, dar FÃRÃ NICI O GARANÞIE; chiar fãrã presupusa garanþie a VANDABILITÃÞII sau MODIFICÃRII ÎNTR-UN SCOP PRIVAT. Cititi Licenþa Publicã Generalã GNU pentru mai multe detalii.

source: -Ft does not set FS to tab in POSIX awk
ro: -Ft nu seteazã FS în tab în POSIX awk

source: floating point exception
ro: excepþie virgulã mobilã

source: fatal error: internal error
ro: eroare fatalã: eroare internã

source: no pre-opened fd %d
ro: nici un fd predeschis %d

source: could not pre-open /dev/null for fd %d
ro: nu s-a putut predeschide /dev/null pentru fd %d

source: could not find groups: %s
ro: nu am putut gãsi grupurile: %s

source: cmd. line:
ro: linie cmd:

source: warning:
ro: avertisment:

source: error:
ro: eroare:

source: can't convert string to float
ro: nu se poate converti ºir de caractere în float

source: backslash at end of string
ro: backslash la sfârºitul ºirului de caractere

source: POSIX does not allow `\x' escapes
ro: POSIX nu permite escape-uri `\x'

source: no hex digits in `\x' escape sequence
ro: nu existã digiþi hexa în secvenþa de escape `\x'

source: escape sequence `\%c' treated as plain `%c'
ro: secvenþa de escape `\%c' tratatã ca `%c' simplu

source: %s %s `%s': could not set close-on-exec: (fcntl: %s)
ro: %s %s `%s': nu s-a putut seta close-on-exec: (fcntl: %s)

source: could not open `%s' for writing: %s
ro: nu am putut deschide `%s' pentru scriere: %s

source: # gawk profile, created %s
ro: # profil gawk, creat %s

source: # BEGIN block(s)
ro: # bloc(uri) BEGIN

source: # Rule(s)
ro: # Regulã(i)

source: # END block(s)
ro: # bloc(uri) END

source: # Functions, listed alphabetically
ro: # Funcþii, listate alfabetic

source: unexpected type %s in prec_level
ro: tip %s neaºteptat în prec_level

source: Success
ro: Succes

source: No match
ro: Nici o potrivire

source: Invalid regular expression
ro: Expresie regularã invalidã

source: Invalid collation character
ro: Caracter de comparare invalid

source: Invalid character class name
ro: nume clasã caracter invalid

source: Trailing backslash
ro: Backslash final

source: Invalid back reference
ro: referinþã anterioarã(back) invalidã

source: Unmatched [ or [^
ro: [ sau [^ fãrã reciprocã

source: Unmatched ( or \(
ro: ( sau \( fãrã reciprocã

source: Unmatched \{
ro: { fãrã reciprocã

source: Invalid content of \{\}
ro: Conþinut invalid al \{\}

source: Invalid range end
ro: Sfârºit de domeniu invalid

source: Memory exhausted
ro: Memorie plinã

source: Invalid preceding regular expression
ro: Expresie regularã anterioarã invalidã

source: Premature end of regular expression
ro: Sfârºit prematur de expresie regularã

source: Regular expression too big
ro: Expresie regularã prea mare

source: Unmatched ) or \)
ro: ) or \) fãrã reciprocã

source: No previous regular expression
ro: Nu existã expresii regulare anterioare
